{
  "data": [
    {
      "title": "YoDoorbell",
      "subtitle": "YHack 2014",
      "description": "YoDoorbell was a project born out of Yale's 2014 hackathon - YHack.  The idea of YoDoorbell was to enhance the everyday doorbell.  When a RFID enabled card was present in front of the Tessel, a Yo containing a picture of the guest would be sent to the registered user.  If the user sent a Yo to the \"YoDoorbell\" account the Tessel would take a picture, gather a temperature reading, and send the data right back to you via the Yo API.  YoDoorbell was built using Node.js and ExpressJS for its backend.  Node.js was also used to program the Tessel microcontroller.",
      "imageUrl": "/images/yhack2.jpg",
      "github": "https://github.com/rperryng/yhack-2014"
    },
    {
      "title": "ExploreTO",
      "subtitle": "Startup Weekend Toronto 2014",
      "description": "ExploreTO was a service built during Toronto's Startup Weekend.  It's aim was to partner with local businesses to provide discounted prices for new things to try on a regular basis.  ExploreTO was a project with modern technologies.  This included Node.js, ExpressJS, MongoDB, AngularJS, HTML, CSS, and more.  ExploreTO was a collaborative project, as I participated with several non-techs, designers, and other developers on the project.",
      "award": "Doer award",
      "imageUrl": "/images/ExploreTO.jpeg",
      "github": "https://github.com/rperryng/ExploreTO"
    },
    {
      "title": "Secret Santa Matcher",
      "subtitle": "December 2014",
      "description": "Every year, my friends and I participate in a secret santa gift exchange.  I created a website to faciliate matching users and showing them suggested gifts by consuming the Facebook API.  This project was created using Node.js, ExpressJS, MongoDB, Angularjs, HTML, LESS/CSS and gulp as the primary build tool.",
      "imageUrl": "/images/secretSanta.jpg",
      "githubUrl": "https://github.com/rperryng/secretSanta"
    }, 
    {
      "title": "Wind Nexus6 Twitter Bot",
      "subtitle": "December 2014",
      "description": "Wind Mobile was running a promotional twitter contest where twitter followers had the chance to win a Nexus 6 if they retweeted specifica tweets in less than 5 minutes.  Instead of manually checking and retweeting my entries, I decided to write a bot to automate the process for me.  This bot was created using Node.js and the twit library.",
      "imageUrl": "/images/twitterBot.jpg",
      "githubUrl": "https://github.com/rperryng/wind-nexus6-bot"
    },
    {
      "title": "Stadium",
      "subtitle": "Hack the north 2014",
      "description": "Stadium was an Android and Web application built during Waterloo's major hackathon - Hack the North. The intention of Stadium was to make it easier to organise and attend pick up sports between players of all levels.  The Android application was built using the Eclipse and Android SDK while the front end web services were built using HTML, CSS, and AngularJS.  The back end portion of the service was built with PHP.",
      "imageUrl": "/images/stadiumMobile.png",
      "githubUrl": "https://github.com/Stadium"
    },
    {
      "title": "CarpUWL",
      "subtitle": "Hackwaterloo 2014",
      "description": "Hackwaterloo was the first hackathon that I had ever attended.  During this hackathon my group and I created CarpUWL, an android application that solves the problem of organising carpooling amongst university students to save money and time.  The Android application was written using the Eclipse IDE and Android SDK, while the back end portion was built with PHP and MySQL.  HackWaterloo was awarded the Engineering society award for having the best hack with a team with a majority of engineers.",
      "award": "Doer award",
      "imageUrl": "/images/carpUWL.png",
      "githubUrl": "https://github.com/Carpuwl/Carpuwl_android"
    },
    {
      "title": "RobotoViews",
      "subtitle": "April 2014",
      "description": "RobotoViews is an android library that makes it easy to use Google's Roboto fonts via xml in Android, which is otherwise impossible.  RobotoViews was made using the Eclipse IDE.",
      "imageUrl": "/images/robotoViews.png",
      "githubUrl": "https://github.com/rperryng/RobotoViews"
    },
    {
      "title": "TutorialViews",
      "subtitle": "March 2014",
      "description": "TutorialViews was an android library intended to make the process of creating jelly-bean styled tutorial views very easy.  TutorialViews was created using the Eclipse IDE.",
      "imageUrl": "/images/tutorialViews.png",
      "githubUrl": "https://github.com/rperryng/TutorialView"
    }
  ]
}
